import { useState } from "react";
import news1 from "../../../assets/images/news1.png";
import news2 from "../../../assets/images/news2.png";
import news3 from "../../../assets/images/news3.png";
import news4 from "../../../assets/images/news4.png";
import news5 from "../../../assets/images/news5.png";
import NewsMetaInfo from "../../../ui/dateAndViewsSection";
import { useNavigate } from "react-router-dom";

const NewsGrid = () => {
  const navigate = useNavigate();
  const allNewsItems = [
    {
      id: 1,
      type: "سياسة",
      image: news1,
      title: "تزامنا مع اشتعال جبهة لبنان.. يوم دام في قطاع غزة",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 2,
      type: "سياسة",
      image: news2,
      title:
        "متمردون ومسيّرات وأموال من الخارج.. مكونات ملف ينذر بصراع بين السودان ...",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 3,
      type: "سياسة",
      image: news3,
      title: "سلوان.. حين يُجبر الفلسطيني على هدم بيته بيده أو دفع أجرة الهدم",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 4,
      type: "سياسة",
      image: news4,
      title: "القدس.. جنود الاحتلال ينكّلون بطفل مصاب بمتلازمة داون",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 5,
      type: "سياسة",
      image: news5,
      title:
        "تحقيق يكشف تستر الجيش الإسرائيلي على بيانات تسريح آلاف الجنود لأسباب نفسية",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 6,
      type: "سياسة",
      image: news1,
      title: "تزامنا مع اشتعال جبهة لبنان.. يوم دام في قطاع غزة",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 7,
      type: "سياسة",
      image: news2,
      title: "تزامنا مع اشتعال جبهة لبنان.. يوم دام في قطاع غزة",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 8,
      type: "سياسة",
      image: news3,
      title: "تزامنا مع اشتعال جبهة لبنان.. يوم دام في قطاع غزة",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 9,
      type: "سياسة",
      image: news4,
      title: "تزامنا مع اشتعال جبهة لبنان.. يوم دام في قطاع غزة",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 10,
      type: "سياسة",
      image: news1,
      title: "تزامنا مع اشتعال جبهة لبنان.. يوم دام في قطاع غزة",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 11,
      type: "سياسة",
      image: news2,
      title:
        "متمردون ومسيّرات وأموال من الخارج.. مكونات ملف ينذر بصراع بين السودان ...",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 12,
      type: "سياسة",
      image: news3,
      title: "سلوان.. حين يُجبر الفلسطيني على هدم بيته بيده أو دفع أجرة الهدم",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 13,
      type: "سياسة",
      image: news4,
      title: "القدس.. جنود الاحتلال ينكّلون بطفل مصاب بمتلازمة داون",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 14,
      type: "سياسة",
      image: news5,
      title:
        "تحقيق يكشف تستر الجيش الإسرائيلي على بيانات تسريح آلاف الجنود لأسباب نفسية",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
    {
      id: 15,
      type: "سياسة",
      image: news1,
      title: "تزامنا مع اشتعال جبهة لبنان.. يوم دام في قطاع غزة",
      desc: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير انيم أد مينيم فينايم,كيواس نوستريد",
    },
  ];

  const [visibleCount, setVisibleCount] = useState(9);
  const itemsToLoad = 6;
  const handleNewsClick = (id) => {
    // Add this function
    navigate(`/News/${id}`);
  };
  const handleLoadMore = () => {
    setVisibleCount((prevCount) =>
      Math.min(prevCount + itemsToLoad, allNewsItems.length),
    );
  };

  const visibleNewsItems = allNewsItems.slice(0, visibleCount);
  const hasMoreItems = visibleCount < allNewsItems.length;

  return (
    <div>
      <div className="flex flex-col space-y-4">
        {visibleNewsItems?.map((newsItem, index) => (
          <div key={index} className="grid grid-cols-2 gap-x-3">
            <div
              onClick={() => handleNewsClick(newsItem.id)} // Add this
              className="relative"
            >
              <img
                src={newsItem?.image}
                className="w-full h-[12rem] rounded-xl object-center"
                alt={newsItem.title}
              />
              <div className="absolute right-[0.5rem] top-[0.5rem] pointer-events-none">
                <div className="w-[5rem] h-[1.8rem] flex justify-center items-center bg-[#005BBF] rounded-full">
                  <p className="text-white font-[400] text-sm mt-1">
                    {newsItem.type}
                  </p>
                </div>
              </div>
            </div>
            <div className="relative">
              <h1 className="text-[#333333] text-[1.1rem] font-bold leading-relaxed">
                {newsItem?.title}
              </h1>
              <p className="text-[#666666] mt-1 text-sm leading-relaxed">
                {newsItem.desc}
              </p>
              <div className="absolute bottom-[0.4rem] pointer-events-none">
                <NewsMetaInfo
                  dateText={"الخميس، 18 مايو 2024"}
                  viewsText={"1.2k"}
                  textColor="text-[#6B7280]"
                />
              </div>
            </div>
          </div>
        ))}
      </div>
      {hasMoreItems && (
        <div className="flex justify-center items-center mt-[2rem]">
          <button
            onClick={handleLoadMore}
            className="flex justify-center items-center w-[14rem] cursor-pointer rounded-md text-white text-sm font-bold h-[2.5rem] bg-[#005BBF] hover:bg-[#004a99] transition-colors"
          >
            <p className="mt-1">شاهد المزيد</p>
          </button>
        </div>
      )}
    </div>
  );
};

export default NewsGrid;
